zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/gamework_data.h"
#include "game/hsfload.h"
#include "game/hu3d.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"

#include "REL/m406Dll.h"
#include <string.h>

#ifndef __MWERKS__
#include "game/frand.h"
#include "game/hsfex.h"
#endif

typedef struct UnkM406PlayerStruct {
    /* 0x00 */ float unk_00;
    /* 0x04 */ float unk_04;
} UnkM406PlayerStruct; /* size = 0x08 */

typedef struct UnkM406PlayerStruct2 {
    /* 0x00 */ HSFFACE *unk_00;
    /* 0x04 */ HSFFACE *unk_04;
    /* 0x08 */ s16 unk_08;
} UnkM406PlayerStruct2; /* size = 0x0C */

typedef struct M406PlayerWork {
    /* 0x00 */ union {
        struct {
            u8 unk_00_field0 : 1;
            u8 unk_00_field1 : 1;
            u8 unk_00_field2 : 1;
            u8 unk_00_field3 : 1;
            u8 unk_00_field4 : 1;
            u8 unk_00_field5 : 1;
        };
        s16 unk_00;
    };
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s8 unk_06;
    /* 0x07 */ s8 unk_07;
    /* 0x08 */ u16 unk_08;
    /* 0x0A */ u16 unk_0A;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ s16 unk_0E;
    /* 0x10 */ s16 unk_10;
    /* 0x12 */ s16 unk_12;
    /* 0x14 */ Vec unk_14;
    /* 0x20 */ char unk20[0xC];
    /* 0x2C */ Vec unk_2C;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ u32 unk_3C;
    /* 0x40 */ float unk_40;
    /* 0x44 */ UnkM406PlayerStruct2 unk_44;
    /* 0x50 */ float unk_50;
    /* 0x54 */ float unk_54;
    /* 0x58 */ s16 unk_58;
    /* 0x5A */ s16 unk_5A;
    /* 0x5C */ s16 unk_5C;
    /* 0x5E */ s16 unk_5E;
    /* 0x60 */ s16 unk_60;
    /* 0x62 */ s16 unk_62;
    /* 0x64 */ s16 unk_64;
    /* 0x68 */ float unk_68;
    /* 0x6C */ float unk_6C;
    /* 0x70 */ float unk_70;
    /* 0x74 */ float unk_74;
    /* 0x78 */ float unk_78;
    /* 0x7C */ s32 unk_7C[2];
} M406PlayerWork; /* size = 0x84 */

void fn_1_1065C(omObjData *object);
void fn_1_10744(omObjData *object);
void fn_1_11058(omObjData *object);
void fn_1_114A0(omObjData *object);
void fn_1_117BC(float arg8, float arg9, UnkM406PlayerStruct2 *arg0, Vec *arg1);
float fn_1_12194(Vec *arg0);
void fn_1_12270(omObjData *object);
void fn_1_1275C();
s32 fn_1_127B8();
s32 fn_1_129E4(omObjData *object);
void fn_1_12AB8(omObjData *object);
void fn_1_12B00(omObjData *object);
void fn_1_12B38(Vec *arg0);
void fn_1_12BC4(omObjData *object);
void fn_1_13A88(s16 arg0, char *arg1, Mtx arg2);
float fn_1_13AF4(float arg8, float arg9, float argA);
s32 fn_1_13C10(Vec *arg0, Vec *arg1);
float fn_1_143F4(Vec *arg0, UnkM406PlayerStruct2 *arg1);
void fn_1_D90C(omObjData *object);
void fn_1_DD7C(omObjData *object, s32 arg1, float arg8, u32 arg2);
void fn_1_DE60(omObjData *object);
void fn_1_E214(omObjData *object);
void fn_1_F194(omObjData *object);
void fn_1_F694(omObjData *object);
void fn_1_FA50(omObjData *object);

Vec lbl_1_data_960[70] = {
    { -495.876f, 50.005f, -0.0f },
    { -500.023f, -2841.226f, -5007.74f },
    { -502.015f, -7170.411f, -12506.11f },
    { -515.622f, -8314.231f, -14487.27f },
    { -515.6f, -8761.908f, -15262.67f },
    { -508.661f, -9195.703f, -16014.02f },
    { -494.762f, -9629.499f, -16765.38f },
    { -473.947f, -10063.294f, -17516.73f },
    { -471.378f, -10495.727f, -18265.73f },
    { -495.719f, -10915.74f, -18993.21f },
    { -552.519f, -11337.781f, -19724.21f },
    { -621.485f, -11611.703f, -20198.66f },
    { -731.018f, -11887.653f, -20676.62f },
    { -950.131f, -12303.607f, -21397.07f },
    { -1209.766f, -12735.795f, -22145.64f },
    { -1469.474f, -13170.012f, -22897.73f },
    { -1627.69f, -13466.252f, -23410.83f },
    { -1757.595f, -13772.641f, -23941.51f },
    { -1838.731f, -14079.026f, -24472.19f },
    { -1871.186f, -14393.528f, -25016.92f },
    { -1834.734f, -14703.97f, -25554.62f },
    { -1749.541f, -15014.414f, -26092.33f },
    { -1623.78f, -15312.685f, -26608.94f },
    { -1384.433f, -15761.101f, -27385.62f },
    { -1124.798f, -16191.259f, -28130.68f },
    { -775.859f, -16769.535f, -29132.28f },
    { -568.923f, -17183.457f, -29849.22f },
    { -398.537f, -17621.73f, -30608.33f },
    { -187.485f, -18055.945f, -31360.41f },
    { 96.491f, -18634.223f, -32362.02f },
    { 254.886f, -19042.057f, -33068.41f },
    { 315.738f, -19315.977f, -33542.85f },
    { 331.965f, -19581.783f, -34003.24f },
    { 291.397f, -19839.473f, -34449.57f },
    { 189.969f, -20091.07f, -34885.35f },
    { -12.871f, -20340.645f, -35317.62f },
    { -325.245f, -20598.332f, -35763.96f },
    { -747.265f, -20870.219f, -36234.88f },
    { -1230.024f, -21152.258f, -36723.38f },
    { -2276.853f, -21730.535f, -37724.99f },
    { -2759.968f, -22028.799f, -38241.6f },
    { -3189.989f, -22343.3f, -38786.33f },
    { -3514.533f, -22669.979f, -39352.15f },
    { -3620.335f, -22840.408f, -39647.35f },
    { -3693.358f, -23018.965f, -39956.61f },
    { -3705.528f, -23193.463f, -40258.85f },
    { -3693.358f, -23367.96f, -40561.09f },
    { -3551.37f, -23698.695f, -41133.94f },
    { -3307.945f, -24019.275f, -41689.2f },
    { -2995.571f, -24323.633f, -42216.36f },
    { -2646.686f, -24621.904f, -42732.99f },
    { -1920.124f, -25200.174f, -43734.58f },
    { -1457.648f, -25612.07f, -44448.0f },
    { -1238.474f, -25871.78f, -44897.83f },
    { -1084.316f, -26137.584f, -45358.22f },
    { -958.555f, -26417.594f, -45843.21f },
    { -861.049f, -26697.596f, -46328.19f },
    { -783.97f, -26979.635f, -46816.69f },
    { -715.004f, -27261.672f, -47305.2f },
    { -617.584f, -27979.957f, -48549.3f },
    { -548.553f, -28700.271f, -49796.93f },
    { -491.712f, -29278.535f, -50798.51f },
    { -475.485f, -29856.814f, -51800.12f },
    { -479.514f, -30433.059f, -52798.2f },
    { -505.531f, -34619.363f, -60049.28f },
    { -513.632f, -34659.062f, -60100.39f },
    { -509.573f, -34721.215f, -60151.54f },
    { -509.589f, -34805.496f, -60191.15f },
    { -509.587f, -34970.055f, -60233.17f },
    { -509.591f, -45195.266f, -61377.84f },
};

Vec lbl_1_data_CA8[70] = {
    { 497.979f, 49.997f, 0.0f },
    { 501.235f, -2841.251f, -5007.79f },
    { 497.983f, -7170.06f, -12505.5f },
    { 479.876f, -8314.231f, -14487.27f },
    { 479.899f, -8761.908f, -15262.67f },
    { 486.837f, -9195.703f, -16014.02f },
    { 500.736f, -9629.499f, -16765.38f },
    { 521.552f, -10063.294f, -17516.73f },
    { 524.121f, -10495.727f, -18265.73f },
    { 503.13f, -10936.027f, -19028.35f },
    { 446.486f, -11379.887f, -19797.14f },
    { 364.665f, -11685.236f, -20326.02f },
    { 245.082f, -11987.438f, -20849.45f },
    { 18.48f, -12434.451f, -21623.7f },
    { -252.156f, -12875.162f, -22387.03f },
    { -497.617f, -13300.134f, -23123.1f },
    { -655.129f, -13580.305f, -23608.37f },
    { -768.419f, -13847.879f, -24071.83f },
    { -843.945f, -14131.193f, -24562.54f },
    { -875.687f, -14393.528f, -25016.92f },
    { -850.353f, -14653.739f, -25467.62f },
    { -768.533f, -14927.61f, -25941.98f },
    { -642.655f, -15201.48f, -26416.33f },
    { -428.664f, -15620.156f, -27141.5f },
    { -170.569f, -16051.424f, -27888.48f },
    { 188.182f, -16636.941f, -28902.62f },
    { 408.467f, -17083.947f, -29676.86f },
    { 572.186f, -17512.059f, -30418.37f },
    { 786.178f, -17940.18f, -31159.9f },
    { 1075.696f, -18525.695f, -32174.04f },
    { 1245.631f, -18972.703f, -32948.28f },
    { 1315.06f, -19274.898f, -33471.7f },
    { 1327.648f, -19592.842f, -34022.39f },
    { 1283.591f, -19907.637f, -34567.64f },
    { 1157.714f, -20235.021f, -35134.68f },
    { 887.077f, -20562.406f, -35701.73f },
    { 496.857f, -20883.496f, -36257.87f },
    { 31.029f, -21188.842f, -36786.75f },
    { -491.693f, -21487.889f, -37304.71f },
    { -1517.594f, -22057.664f, -38291.59f },
    { -1958.808f, -22331.527f, -38765.94f },
    { -2323.853f, -22595.953f, -39223.93f },
    { -2588.195f, -22850.938f, -39665.58f },
    { -2651.134f, -22964.264f, -39861.87f },
    { -2695.42f, -23074.441f, -40052.7f },
    { -2714.302f, -23187.768f, -40248.99f },
    { -2689.126f, -23316.832f, -40472.53f },
    { -2594.718f, -23552.928f, -40881.46f },
    { -2393.337f, -23814.195f, -41334.0f },
    { -2116.406f, -24081.771f, -41797.45f },
    { -1782.831f, -24371.38f, -42299.07f },
    { -1059.036f, -24941.158f, -43285.95f },
    { -561.404f, -25391.299f, -44065.62f },
    { -290.767f, -25709.24f, -44616.31f },
    { -108.245f, -26024.033f, -45161.55f },
    { 23.926f, -26323.088f, -45679.52f },
    { 130.922f, -26625.29f, -46202.95f },
    { 212.947f, -26918.023f, -46709.98f },
    { 275.886f, -27213.93f, -47222.51f },
    { 376.588f, -27941.104f, -48482.01f },
    { 452.187f, -28658.824f, -49725.14f },
    { 508.832f, -29241.193f, -50733.83f },
    { 521.5f, -29814.105f, -51726.14f },
    { 515.985f, -30433.059f, -52798.2f },
    { 503.81f, -34617.785f, -60046.38f },
    { 495.709f, -34657.49f, -60097.48f },
    { 499.768f, -34719.64f, -60148.64f },
    { 499.752f, -34803.92f, -60188.25f },
    { 499.754f, -34968.48f, -60230.3f },
    { 499.75f, -45193.69f, -61374.92f },
};

float lbl_1_data_FF0[4] = { -300.0f, -100.0f, 100.0f, 300.0f };

char *lbl_1_data_1068[4] = {
    "test11_tex_we-itemhook-l",
    "test11_tex_we-itemhook-r",
    "test11_tex_we-itemhook-fl",
    "test11_tex_we-itemhook-fr",
};

s32 lbl_1_data_1078[10] = {
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x37),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x55),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x39),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x54),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x41),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x56),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x50),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x16),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x53),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x23),
};

s32 lbl_1_data_10A0[8][4] = {
    { DATA_MAKE_NUM(DATADIR_M406, 0), DATA_MAKE_NUM(DATADIR_M406, 1), DATA_MAKE_NUM(DATADIR_M406, 16), DATA_MAKE_NUM(DATADIR_M406, 17) },
    { DATA_MAKE_NUM(DATADIR_M406, 2), DATA_MAKE_NUM(DATADIR_M406, 3), DATA_MAKE_NUM(DATADIR_M406, 18), DATA_MAKE_NUM(DATADIR_M406, 19) },
    { DATA_MAKE_NUM(DATADIR_M406, 4), DATA_MAKE_NUM(DATADIR_M406, 5), DATA_MAKE_NUM(DATADIR_M406, 20), DATA_MAKE_NUM(DATADIR_M406, 21) },
    { DATA_MAKE_NUM(DATADIR_M406, 6), DATA_MAKE_NUM(DATADIR_M406, 7), DATA_MAKE_NUM(DATADIR_M406, 22), DATA_MAKE_NUM(DATADIR_M406, 23) },
    { DATA_MAKE_NUM(DATADIR_M406, 8), DATA_MAKE_NUM(DATADIR_M406, 9), DATA_MAKE_NUM(DATADIR_M406, 24), DATA_MAKE_NUM(DATADIR_M406, 25) },
    { DATA_MAKE_NUM(DATADIR_M406, 10), DATA_MAKE_NUM(DATADIR_M406, 11), DATA_MAKE_NUM(DATADIR_M406, 26), DATA_MAKE_NUM(DATADIR_M406, 27) },
    { DATA_MAKE_NUM(DATADIR_M406, 12), DATA_MAKE_NUM(DATADIR_M406, 13), DATA_MAKE_NUM(DATADIR_M406, 28), DATA_MAKE_NUM(DATADIR_M406, 29) },
    { DATA_MAKE_NUM(DATADIR_M406, 14), DATA_MAKE_NUM(DATADIR_M406, 15), DATA_MAKE_NUM(DATADIR_M406, 30), DATA_MAKE_NUM(DATADIR_M406, 31) },
};

s32 lbl_1_data_1120[8] = {
    DATA_MAKE_NUM(DATADIR_M406, 69),
    DATA_MAKE_NUM(DATADIR_M406, 70),
    DATA_MAKE_NUM(DATADIR_M406, 71),
    DATA_MAKE_NUM(DATADIR_M406, 72),
    DATA_MAKE_NUM(DATADIR_M406, 73),
    DATA_MAKE_NUM(DATADIR_M406, 74),
    DATA_MAKE_NUM(DATADIR_M406, 75),
    DATA_MAKE_NUM(DATADIR_M406, 76),
};

s16 lbl_1_data_1140[4] = { 0, 40, 20, 90 };

