zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
omObjData *lbl_1_bss_1F8;
s16 lbl_1_bss_1F6;
s16 lbl_1_bss_1F4;
s16 lbl_1_bss_1E8[6];
s16 lbl_1_bss_1DC[6];
s16 lbl_1_bss_1D0[6];
s32 lbl_1_bss_1CC;
Process *lbl_1_bss_1C8;
s32 lbl_1_bss_1C4;
Vec lbl_1_bss_104[16];
float lbl_1_bss_100;
s32 lbl_1_bss_F8[2];
Vec lbl_1_bss_E0[2];
s32 lbl_1_bss_DC;
s32 lbl_1_bss_D8;

#ifndef __MWERKS__
static u32 m406PhysicsDiagnosticTicks;
static s32 m406PhysicsDiagnosticState = -1;
static s32 m406PhysicsDiagnosticMainState = -1;
#endif

void fn_1_D65C(Process *arg0)
{
    HSFMATERIAL *var_r31;
    s32 var_r30;
    s32 var_r29;
    HSFDATA *var_r28;
    omObjData **var_r26;
    HU3DMODEL *var_r25;
    lbl_1_bss_1CC = -1;
    lbl_1_bss_1F6 = lbl_1_bss_1F4 = 0;
    lbl_1_bss_1C8 = arg0;
    omMakeGroupEx(arg0, 0, 4);
    for (var_r30 = 0; var_r30 < 4; var_r30++) {
        omAddObjEx(arg0, 0x40, 0xA, 0x32, 0, fn_1_D90C);
    }
    /* The original executes Avalanche physics from a 60 Hz render hook after
     * every object callback, including the priority-255 game controller.  Run
     * it once per fixed simulation tick, but preserve that ordering so it sees
     * the controller's current state rather than the previous tick's state. */
    omAddObjEx(arg0, 0x100, 0, 0, -1, fn_1_FA50);
    lbl_1_bss_1F8 = omAddObjEx(arg0, 0x45, 0, 0, -1, fn_1_12B00);
    var_r26 = omGetGroupMemberListEx(HuPrcCurrentGet(), 2);
    for (var_r30 = 0; var_r30 < 6; var_r30++) {
        lbl_1_bss_1E8[var_r30] = lbl_1_bss_1DC[var_r30] = lbl_1_bss_1D0[var_r30] = -1;
        var_r25 = &Hu3DData[(*var_r26)->model[var_r30]];
        var_r28 = var_r25->hsf;
        for (var_r29 = 0; var_r29 < var_r28->materialNum; var_r29++) {
            var_r31 = &var_r28->material[var_r29];
            if (var_r31->color[0] == 0xFF && var_r31->color[1] == 0 && var_r31->color[2] == 0) {
                lbl_1_bss_1E8[var_r30] = var_r29;
            }
            if (var_r31->color[0] == 0 && var_r31->color[1] == 0xFF && var_r31->color[2] == 0) {
                lbl_1_bss_1D0[var_r30] = var_r29;
            }
            if (var_r31->color[0] == 0 && var_r31->color[1] == 0 && var_r31->color[2] == 0xFF) {
                lbl_1_bss_1DC[var_r30] = var_r29;
            }
        }
    }
}

void fn_1_D8B0(void)
{
    s32 var_r31;
    omObjData **var_r30;

    var_r30 = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        fn_1_12AB8(var_r30[var_r31]);
    }
}

void fn_1_D90C(omObjData *object)
{
    Mtx sp8;

    M406PlayerWork *var_r31;
    s32 var_r29;
    s32 var_r28;

    object->data = var_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(M406PlayerWork), MEMORY_DEFAULT_NUM);
    memset(var_r31, 0, sizeof(M406PlayerWork));
    var_r31->unk_02 = lbl_1_bss_1F6++;
    var_r31->unk_00_field0 = 0;
    var_r31->unk_00_field1 = 1;
    var_r31->unk_04 = GWPlayerCfg[var_r31->unk_02].pad_idx;
    var_r28 = var_r31->unk_0C = GWPlayerCfg[var_r31->unk_02].character;
    var_r31->unk_0E = GWPlayerCfg[var_r31->unk_02].diff;
    var_r31->unk_10 = GWPlayerCfg[var_r31->unk_02].group;
    object->model[0] = CharModelCreate(var_r28, 8);
    for (var_r29 = 0; var_r29 < 4; var_r29++) {
        object->model[var_r29 + 1] = Hu3DModelCreateFile(lbl_1_data_10A0[var_r28][var_r29]);
        Hu3DModelHookSet(object->model[0], lbl_1_data_1068[var_r29], object->model[var_r29 + 1]);
    }
    Hu3DModelShadowSet(object->model[0]);
    CharEffectLayerSet(Hu3DData[object->model[0]].layerNo + 1);
    object->model[5] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 32));
    Hu3DModelHookSet(object->model[0], "test11_tex_we-itemhook-body", object->model[5]);
    Hu3DModelAttrSet(object->model[5], HU3D_ATTR_DISPOFF);
    fn_1_13A88(object->model[0], "test11_tex_we-itemhook-body", sp8);
    var_r31->unk_68 = sp8[0][3];
    var_r31->unk_6C = sp8[1][3];
    var_r31->unk_70 = sp8[2][3];
    object->model[6] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 33));
    Hu3DModelAttrSet(object->model[6], HU3D_ATTR_DISPOFF);
    object->model[7] = Hu3DModelCreateFile(lbl_1_data_1120[var_r31->unk_0C]);
    Hu3DModelAttrSet(object->model[7], HU3D_ATTR_DISPOFF);
    for (var_r29 = 0; var_r29 < 10U; var_r29++) {
        object->motion[var_r29] = CharMotionCreate(var_r31->unk_0C, lbl_1_data_1078[var_r29]);
    }
    var_r31->unk_38 = -1;
    var_r31->unk_58 = 0;
    var_r31->unk_14.y = 0.0f;
    var_r31->unk_14.z = 45.0f;
    fn_1_DD7C(object, 0, 1.0f, HU3D_MOTATTR_LOOP);
    object->trans.x = lbl_1_data_FF0[var_r31->unk_02];
    object->trans.z = -500.0f;
    object->trans.y = fn_1_143F4(&object->trans, &var_r31->unk_44);
    fn_1_117BC(var_r31->unk_14.x, 50.0f, &var_r31->unk_44, &var_r31->unk_2C);
    object->rot.x = 30.0f;
    object->rot.y = 180.0f;
    #if VERSION_NTSC
    object->work[3] = lbl_1_data_1140[var_r31->unk_02];
    #else
    object->work[3] = (lbl_1_data_1140[var_r31->unk_02]*REFRESH_RATE)/60;
    #endif
    CharModelDataClose(var_r31->unk_0C);
    var_r31->unk_7C[0] = var_r31->unk_7C[1] = -1;
    var_r31->unk_78 = 600.0f * ((frand() & 0x1FF) - 256.0f) / 256.0f;
    object->func = fn_1_DE60;
}

Vec lbl_1_data_1164[12] = {
    { -100.0f, 0.0f, -1000.0f },
    { -200.0f, 0.0f, -2000.0f },
    { -100.0f, 0.0f, -3000.0f },
    { -50.0f, 0.0f, -1000.0f },
    { 100.0f, 0.0f, -1500.0f },
    { 0.0f, 0.0f, -3000.0f },
    { 100.0f, 0.0f, -1000.0f },
    { -100.0f, 0.0f, -2000.0f },
    { 200.0f, 0.0f, -3000.0f },
    { 200.0f, 0.0f, -1000.0f },
    { 300.0f, 0.0f, -1500.0f },
    { -100.0f, 0.0f, -3000.0f },
};

s32 lbl_1_data_11F4 = (REFRESH_RATE*16)/5;

UnkM406PlayerStruct lbl_1_data_11F8[4] = {
    { -300.0f, -600.0f },
    { -100.0f, -400.0f },
    { 100.0f, -300.0f },
    { 450.0f, -900.0f },
};

UnkM406PlayerStruct lbl_1_data_1218[3] = {
    { -320.0f, -700.0f },
    { 250.0f, -1000.0f },
    { 380.0f, -500.0f },
};

void fn_1_DD7C(omObjData *object, s32 arg1, float arg8, u32 arg2)
{
    HU3DMODEL *spC;
    M406PlayerWork *var_r31;

    var_r31 = object->data;
    spC = &Hu3DData[object->model[0]];
    if (arg1 != var_r31->unk_38) {
        CharMotionShiftSet(var_r31->unk_0C, object->motion[arg1], 0.0f, 10.0f, arg2);
        var_r31->unk_40 = -1.0f;
        var_r31->unk_38 = arg1;
        var_r31->unk_3C = arg2;
    }
    if (arg8 != var_r31->unk_40) {
        CharMotionSpeedSet(var_r31->unk_0C, arg8);
        var_r31->unk_40 = arg8;
    }
}

void fn_1_DE60(omObjData *object)
{
    float sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;
    float var_f27;
    float var_f26;

