zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
    M406PlayerWork *var_r30;
    Vec *var_r29;

    var_r30 = object->data;
    if (var_r30->unk_00_field4 == 0) {
        if (fn_1_122C() <= 1 && var_r30->unk_7C[0] < 0) {
            var_r30->unk_7C[0] = HuAudFXEmiterPlay(0x53A, &object->trans);
        }
        if (object->work[3] != 0) {
            object->work[3] -= 1;
            return;
        }
        var_r29 = &lbl_1_data_1164[object->work[0] + (var_r30->unk_02 * 3)];
        var_f31 = var_r29->x - object->trans.x;
        var_f30 = var_r29->z - object->trans.z;
        var_f27 = atan2d(-var_f31, -var_f30);
        var_r30->unk_14.x += 0.1f * (var_f27 - var_r30->unk_14.x);
        var_f26 = sqrtf((var_f31 * var_f31) + (var_f30 * var_f30));
        if (var_f26 < 100.0f) {
            object->work[0]++;
            if (object->work[0] > 2) {
                var_r30->unk_00_field4 = 1;
                var_r30->unk_14.x = 0.0f;
                object->trans.x = lbl_1_data_FF0[var_r30->unk_02];
                object->trans.z = -3000.0f;
                object->trans.y = fn_1_143F4(&object->trans, &var_r30->unk_44);
                fn_1_117BC(var_r30->unk_14.x, 50.0f, &var_r30->unk_44, &var_r30->unk_2C);
                object->func = fn_1_E214;
            }
        }
        fn_1_F694(object);
        object->trans.x += var_r30->unk_2C.x;
        object->trans.y += var_r30->unk_2C.y;
        object->trans.z += var_r30->unk_2C.z;
        object->trans.y = fn_1_143F4(&object->trans, &var_r30->unk_44);
        object->rot.x = 30.0f;
        object->rot.y = 180.0f + var_r30->unk_14.x;
        HuAudFXEmiterUpDate(var_r30->unk_7C[0], &object->trans);
    }
}

void fn_1_E214(omObjData *object)
{
    Mtx sp94;
    Mtx sp64;
    Mtx sp34;
    Vec sp28;
    Vec sp1C;

    float var_f31;
    float var_f30;
    float var_f29;
    double var_f28;

    M406PlayerWork *var_r31;
    u16 var_r27;
    HU3DMODEL *var_r26;
    u16 var_r25;
    s32 var_r24;
    s16 var_r23;
    s16 var_r22;

    var_r31 = object->data;
    var_r27 = 0xFFFF;
    var_r25 = 0;
    var_r26 = &Hu3DData[object->model[0]];

    if (fn_1_122C() >= 2) {
        if (var_r31->unk_00_field0 != 0) {
            fn_1_DD7C(object, 9, 1.0f, HU3D_MOTATTR_NONE);
            if ((var_r26->attr & 1) == 0) {
                Hu3D3Dto2D(&object->trans, 1, &sp28);
                if (sp28.x < 0.0 || sp28.x >= 576.0f || sp28.y < 0.0 || sp28.y >= 480.0f) {
                    Hu3DModelAttrSet(object->model[0], HU3D_ATTR_DISPOFF);
                }
            }
            return;
        }
        if (fn_1_122C() != 4) {
            var_r31->unk_08 = var_r31->unk_0A = 0;
            var_r31->unk_06 = var_r31->unk_07 = 0;
        }
        else if (!GWPlayerCfg[var_r31->unk_02].iscom) {
            var_r31->unk_06 = HuPadStkX[var_r31->unk_04];
            var_r31->unk_07 = HuPadStkY[var_r31->unk_04];
            var_r31->unk_08 = HuPadBtn[var_r31->unk_04];
            var_r31->unk_0A = HuPadBtnDown[var_r31->unk_04];
        }
        else {
            var_r31->unk_08 = var_r31->unk_0A = 0;
            var_r31->unk_06 = var_r31->unk_07 = 0;
            fn_1_12270(object);
        }
        switch (var_r31->unk_12) {
            case 0:
                var_r23 = (var_r31->unk_06 * cosd(CRot.y)) - var_r31->unk_07 * sind(CRot.y);
                var_r22 = (var_r31->unk_06 * sind(CRot.y)) + var_r31->unk_07 * cosd(CRot.y);
                if (((var_r23 * var_r23) + (var_r22 * var_r22)) > 16.0f) {
                    var_f29 = 180.0 + (atan2d(var_r23, -var_r22));
                    var_r31->unk_14.x = fn_1_13AF4(var_r31->unk_14.x, var_f29, 0.05f);
                    if (var_r31->unk_14.x >= 180.0f) {
                        var_r31->unk_14.x -= 360.0f;
                    }
                    if (var_r31->unk_14.x < -60.0f) {
                        var_r31->unk_14.x = -60.0f;
                    }
                    else if (var_r31->unk_14.x > 60.0f) {
                        var_r31->unk_14.x = 60.0f;
                    }
                }
                var_r27 = 0;
                var_f31 = 1.0f;
                var_r25 = 1;
                if (var_r31->unk_00_field2 == 0 && var_r31->unk_58 == 0 && var_r31->unk_0A & 0x100) {
                    var_r31->unk_58 = 0x1E;
                    var_r31->unk_38 = -1;
                    var_r31->unk_62 = 0;
                }
                if (var_r31->unk_58 != 0) {
                    var_r27 = 1;
                    var_f31 = 1.0f;
                    var_r25 = 0;
                    var_r31->unk_58--;
                    if (var_r31->unk_58 == 5) {
                        HuAudFXPlay(0x540);
                        fn_1_117BC(var_r31->unk_14.x, 10.0f, &var_r31->unk_44, &sp1C);
                        VECAdd(&var_r31->unk_2C, &sp1C, &var_r31->unk_2C);
                    }
                }
                if (var_r31->unk_00_field2 == 0) {
                    if (var_r31->unk_44.unk_08 == 1) {
                        var_r31->unk_00_field2 = 1;
                        var_r31->unk_60 = 0x14;
                        VECScale(&var_r31->unk_2C, &var_r31->unk_2C, 1.5f);
                        if (VECMag(&var_r31->unk_2C) > 50.0f) {
                            VECNormalize(&var_r31->unk_2C, &var_r31->unk_2C);
                            VECScale(&var_r31->unk_2C, &var_r31->unk_2C, 50.0f);
                        }
                        HuAudFXPlay(0x53E);
                        HuAudFXVolSet(var_r31->unk_7C[0], 0);
                        CharFXPlay(var_r31->unk_0C, 0x125);
                    }
                    if (fn_1_122C() == 4) {
                        var_r31->unk_62++;
                        if (var_r31->unk_62 > (REFRESH_RATE*4.0f)) {
                            var_r31->unk_62 = REFRESH_RATE*4;
                        }
                    }
                }
                else {
                    var_r27 = 4;
                    var_f31 = 2.0f;
                    var_r25 = 0;
                    if (var_r31->unk_60 == 0 && var_r31->unk_00_field1 != 0) {
                        var_r31->unk_00_field2 = 0;
                        HuAudFXPlay(0x53D);
                        HuAudFXVolSet(var_r31->unk_7C[0], 127);
                    }
                    if (var_r31->unk_60 != 0) {
                        var_r31->unk_60--;
                    }
                }
                if (fn_1_129E4(object) != 0) {
                    var_r31->unk_00_field3 = 1;
                    var_r31->unk_12 = 1;
                    var_r31->unk_5A = 10;
                    var_r31->unk_54 = 1.0f;
                    var_r31->unk_78 = 0.0f;
                    var_r31->unk_62 = 0;
                    fn_1_117BC(var_r31->unk_14.x, 50.0f, &var_r31->unk_44, &var_r31->unk_2C);
                    omVibrate(var_r31->unk_02, 12, 6, 6);
                    var_r31->unk_7C[1] = HuAudFXPlay(0x53C);
                }
                break;
            case 1:
                var_r27 = 6;
                var_f31 = 1.0f;
                var_r25 = 0;
                if (--var_r31->unk_5A == 0) {
                    var_r31->unk_12 = 2;
                    var_r31->unk_5A = 60;
                }
                break;
            case 2:
                Hu3DModelAttrReset(object->model[5], HU3D_ATTR_DISPOFF);
                if (var_r31->unk_5A < 20) {
                    var_r31->unk_54 = var_r31->unk_5A / 20.0f;
                }
                else {
                    var_r31->unk_54 = 1.0f;
                }
                var_f30 = (0x3C - var_r31->unk_5A) / 10.0f;
                if (var_f30 > 1.0f) {
                    var_f30 = 1.0f;
                }
                Hu3DModelScaleSet(object->model[5], var_f30, var_f30, var_f30);
                var_r31->unk_50 += VECMag(&var_r31->unk_2C) / 3.125f;
                MTXTrans(sp94, -var_r31->unk_68, -var_r31->unk_6C, -var_r31->unk_70);
                MTXRotRad(sp64, 0x78, 0.017453292f * var_r31->unk_50);
                MTXConcat(sp64, sp94, sp34);
                MTXTrans(sp94, var_r31->unk_68, var_r31->unk_6C, var_r31->unk_70);
                MTXConcat(sp94, sp34, var_r26->mtx);
                var_r27 = 6;
                var_f31 = 2.0f;
                var_r25 = 0;
                if (--var_r31->unk_5A == 0) {
                    var_r31->unk_12 = 3;
                    if (var_r31->unk_7C[1] >= 0) {
                        HuAudFXStop(var_r31->unk_7C[1]);
                        var_r31->unk_7C[1] = -1;
                    }
                }
                break;
            case 3:
                if (var_r31->unk_5E == 0 && var_r31->unk_0A & 0x100) {
                    var_r31->unk_5E = 8;
                }
                if (var_r31->unk_00_field1) {
                    var_r31->unk_2C.x = var_r31->unk_2C.y = var_r31->unk_2C.z = 0.0f;
                }
                var_r31->unk_50 = fn_1_13AF4(var_r31->unk_50, 0.0f, 0.5f);
                MTXTrans(sp94, -var_r31->unk_68, -var_r31->unk_6C, -var_r31->unk_70);
                MTXRotRad(sp64, 0x78, 0.017453292f * var_r31->unk_50);
                MTXConcat(sp64, sp94, sp34);
                MTXTrans(sp94, var_r31->unk_68, var_r31->unk_6C, var_r31->unk_70);
                MTXConcat(sp94, sp34, var_r26->mtx);
                if (var_r31->unk_5E != 0) {
                    MTXTrans(sp94, 100.0f * (0.2f * (((var_r31->unk_5E & 1) * 2) - 1)), 0.0f, 0.0f);
                    MTXConcat(sp94, var_r26->mtx, var_r26->mtx);
                    if (--var_r31->unk_5E == 0) {
                        if (++var_r31->unk_5C >= 4) {
                            var_r31->unk_00_field3 = 0;
                            var_r31->unk_12 = 0;
                            var_r31->unk_5C = 0;
                            Hu3DModelAttrSet(object->model[5], HU3D_ATTR_DISPOFF);
                            Hu3DData[object->model[6]].motWork.time = 0.0f;
                            Hu3DModelPosSet(object->model[6], object->trans.x + var_r31->unk_68, object->trans.y + var_r31->unk_6C,
                                object->trans.z + var_r31->unk_70);
                            Hu3DModelAttrReset(object->model[6], HU3D_ATTR_DISPOFF);
                            MTXIdentity(var_r26->mtx);
                            fn_1_117BC(var_r31->unk_14.x, 25.0f, &var_r31->unk_44, &var_r31->unk_2C);
                        }
                    }
                }
                var_r27 = 7;
                var_f31 = 1.0f;
                var_r25 = 1;
                break;
        }
        if (Hu3DMotionEndCheck(object->model[6])) {
            Hu3DModelAttrSet(object->model[6], HU3D_ATTR_DISPOFF);
        }
        fn_1_DD7C(object, var_r27, var_f31, var_r25);
        fn_1_F194(object);
        if (object->trans.z + var_r31->unk_2C.z < -60000.0f) {
            lbl_1_bss_1CC = var_r31->unk_02;
            return;
        }
        sp28.x = object->trans.x;
        sp28.y = object->trans.y;
        sp28.z = object->trans.z;
        if (fn_1_6A44(sp28) == 1) {
            var_r31->unk_00_field0 = 1;
            var_r26 = &Hu3DData[object->model[0]];
            MTXIdentity(var_r26->mtx);
            omVibrate(var_r31->unk_02, 0xC, 4, 2);
            CharFXPlayPos(var_r31->unk_0C, 0x123, &object->trans);
            for (var_r24 = 0; var_r24 < 2; var_r24++) {
                if (var_r31->unk_7C[var_r24] >= 0) {
                    HuAudFXStop(var_r31->unk_7C[var_r24]);
                    var_r31->unk_7C[var_r24] = -1;
                }
            }
        }
        object->rot.y = 180.0f + var_r31->unk_14.x;
    }
}

