zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
void fn_1_F194(omObjData *object)
{
    Mtx sp80;
    Mtx sp50;
    Vec sp44;
    Vec sp38;
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;
    float var_f27;

    M406PlayerWork *var_r31;
    HU3DMODEL *var_r30;

    var_r31 = object->data;
    var_r30 = &Hu3DData[object->model[0]];
    if (var_r31->unk_00_field1 && var_r31->unk_44.unk_00 != NULL) {
        var_f27 = !var_r31->unk_00_field3 ? 0.7f : 3.5f;
        sp44.x = 0.0f;
        sp44.y = -((980.0f/REFRESH_RATE)/REFRESH_RATE);
        sp44.z = 0.0f;
        var_f28 = ((980.0f/REFRESH_RATE)/REFRESH_RATE) * var_r31->unk_44.unk_00->nbt.y;
        VECScale(&var_r31->unk_44.unk_00->nbt, &sp38, var_f28);
        VECAdd(&sp44, &sp38, &sp2C);
        VECAdd(&var_r31->unk_2C, &sp2C, &var_r31->unk_2C);
        sp20.x = sp20.y = sp20.z = 0.0f;
        sp14.x = sp14.y = sp14.z = 0.0f;
        var_f29 = VECMag(&var_r31->unk_2C);
        if (var_f29 > 0.0f && fn_1_122C() == 4) {
            VECNormalize(&var_r31->unk_2C, &sp8);
            sp20.x = -sp8.x;
            sp20.y = -sp8.y;
            sp20.z = -sp8.z;
            if (var_r31->unk_62 < (REFRESH_RATE*2.0f)) {
                VECScale(&sp20, &sp20, var_f28 * var_f27);
            }
            else {
                VECScale(&sp20, &sp20, (0.15f * (var_r31->unk_62 / (REFRESH_RATE*4.0f))) + (var_f28 * var_f27));
            }
            if (!var_r31->unk_00_field3) {
                fn_1_117BC(var_r31->unk_14.x, 1.0f, &var_r31->unk_44, &sp44);
                var_f30 = VECDotProduct(&sp44, &sp8);
                var_f31 = 0.02f * var_f29;
                sp14.x = (-sp8.x * var_f31) - (var_f30 * (-sp44.x * var_f31));
                sp14.y = (-sp8.y * var_f31) - (var_f30 * (-sp44.y * var_f31));
                sp14.z = (-sp8.z * var_f31) - (var_f30 * (-sp44.z * var_f31));
                if ((var_f30 < 0.9f) && (var_f29 >= 20.0f)) {
                    mtxRot(sp80, var_r30->rot.x, var_r30->rot.y, var_r30->rot.z);
                    mtxTransCat(sp80, var_r30->pos.x, var_r30->pos.y, var_r30->pos.z);
                    VECCrossProduct(&sp44, &sp8, &sp44);
                    if (sp44.y >= 0.0f) {
                        MTXTrans(sp50, -10.0f, 0.0f, 0.0f);
                        MTXConcat(sp50, sp80, sp80);
                        fn_1_94C0(sp80, 10, 0);
                    }
                    else {
                        MTXTrans(sp50, 10.0f, 0.0f, 0.0f);
                        MTXConcat(sp50, sp80, sp80);
                        fn_1_94C0(sp80, 10, 1);
                    }
                }
            }
        }
        VECAdd(&sp20, &sp14, &sp2C);
        if (VECMag(&sp2C) > var_f29) {
            var_r31->unk_2C.x = var_r31->unk_2C.y = var_r31->unk_2C.z = 0.0f;
            return;
        }
        VECAdd(&var_r31->unk_2C, &sp2C, &var_r31->unk_2C);
        return;
    }
    var_r31->unk_2C.y += -((980.0f/REFRESH_RATE)/REFRESH_RATE);
}

void fn_1_F694(omObjData *object)
{
    Mtx sp68;
    Mtx sp38;
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;

    M406PlayerWork *var_r31;
    HU3DMODEL *var_r30;

    var_r31 = object->data;
    var_r30 = &Hu3DData[object->model[0]];
    var_r31->unk_2C.y += -1.0f;
    if (var_r31->unk_00_field1 && var_r31->unk_44.unk_00 != NULL) {
        sp2C.x = var_r31->unk_2C.x;
        sp2C.y = var_r31->unk_2C.y;
        sp2C.z = var_r31->unk_2C.z;

        var_f30 = -((var_r31->unk_44.unk_00->nbt.z * sp2C.z) + ((var_r31->unk_44.unk_00->nbt.x * sp2C.x) + (var_r31->unk_44.unk_00->nbt.y * sp2C.y)));

        sp2C.x += var_f30 * var_r31->unk_44.unk_00->nbt.x;
        sp2C.y += var_f30 * var_r31->unk_44.unk_00->nbt.y;
        sp2C.z += var_f30 * var_r31->unk_44.unk_00->nbt.z;
        if (!var_r31->unk_00_field3) {
            fn_1_117BC(var_r31->unk_14.x, 1.0f, &var_r31->unk_44, &sp20);
            VECNormalize(&sp2C, &sp14);
            var_f29 = VECDotProduct(&sp20, &sp14);
            var_f31 = var_f29 * var_f29;
            var_f31 *= var_f31;
            if (var_f31 < 0.999f && VECMag(&var_r31->unk_2C) >= 10.0f) {
                mtxRot(sp68, var_r30->rot.x, var_r30->rot.y, var_r30->rot.z);
                mtxTransCat(sp68, var_r30->pos.x, var_r30->pos.y, var_r30->pos.z);
                VECCrossProduct(&sp20, &sp14, &sp8);
                if (sp8.y >= 0.0f) {
                    MTXTrans(sp38, -10.0f, 0.0f, 0.0f);
                    MTXConcat(sp38, sp68, sp68);
                    fn_1_94C0(sp68, 10, 0);
                }
                else {
                    MTXTrans(sp38, 10.0f, 0.0f, 0.0f);
                    MTXConcat(sp38, sp68, sp68);
                    fn_1_94C0(sp68, 10, 1);
                }
            }
            var_f28 = VECMag(&sp2C);
            VECScale(&sp20, &sp20, var_f28);
            var_r31->unk_2C.x = sp2C.x + (0.9f * (sp20.x - sp2C.x));
            var_r31->unk_2C.y = sp2C.y + (0.9f * (sp20.y - sp2C.y));
            var_r31->unk_2C.z = sp2C.z + (0.9f * (sp20.z - sp2C.z));
        }
        else {
            var_r31->unk_2C.x = sp2C.x;
            var_r31->unk_2C.y = sp2C.y;
            var_r31->unk_2C.z = sp2C.z;
            VECScale(&var_r31->unk_2C, &var_r31->unk_2C, var_r31->unk_54);
        }
        VECScale(&var_r31->unk_2C, &var_r31->unk_2C, 0.98f);
    }
}

void fn_1_FA50(omObjData *object)
{
    omObjData *sp2C[4];
    Vec sp20;
    Vec sp14;
    Vec sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;
    float var_f27;
    float var_f26;
    float var_f25;

    M406PlayerWork *var_r31;
    omObjData *var_r30;
    s32 var_r29;
    omObjData **var_r28;
    s32 var_r27;
    s32 var_r26;
    s32 var_r25;
    omObjData *var_r24;
    omObjData *var_r23;
    M406PlayerWork *var_r22;
    M406PlayerWork *var_r21;

#ifndef __MWERKS__
    ++m406PhysicsDiagnosticTicks;
    if (m406PhysicsDiagnosticState != lbl_1_bss_D8 ||
        m406PhysicsDiagnosticMainState != fn_1_122C()) {
        m406PhysicsDiagnosticState = lbl_1_bss_D8;
        m406PhysicsDiagnosticMainState = fn_1_122C();
        OSReport("[M406] physics tick=%u state=%d main=%d\n",
            m406PhysicsDiagnosticTicks, lbl_1_bss_D8, fn_1_122C());
    }
#endif

    if (omPauseChk() == 0) {
        var_r28 = omGetGroupMemberListEx(lbl_1_bss_1C8, 0);
#ifndef __MWERKS__
        if (fn_1_122C() == 4 && (m406PhysicsDiagnosticTicks % 120) == 0 &&
            var_r28 != NULL && var_r28[0] != NULL && var_r28[0]->data != NULL) {
            M406PlayerWork *diagnosticPlayer = var_r28[0]->data;
            OSReport("[M406] gameplay tick=%u pad=%d stick=%d,%d button=%04x pos=%.2f,%.2f,%.2f vel=%.2f,%.2f,%.2f\n",
                m406PhysicsDiagnosticTicks, diagnosticPlayer->unk_04,
                diagnosticPlayer->unk_06, diagnosticPlayer->unk_07,
                diagnosticPlayer->unk_08, var_r28[0]->trans.x,
                var_r28[0]->trans.y, var_r28[0]->trans.z,
                diagnosticPlayer->unk_2C.x, diagnosticPlayer->unk_2C.y,
                diagnosticPlayer->unk_2C.z);
        }
#endif
        switch (lbl_1_bss_D8) {
            case 0:
                if (--lbl_1_data_11F4 == 0) {
                    fn_1_123C();
                    lbl_1_bss_D8++;
                    lbl_1_bss_F8[0] = lbl_1_bss_F8[1] = 0;
                }
                if ((lbl_1_data_11F4 % 6) == 0) {
                    for (var_r29 = 0; var_r29 < 4; var_r29++) {
                        var_r31 = var_r28[var_r29]->data;
                        omVibrate(var_r31->unk_02, 6, 2, 4);
                    }
                    return;
                }
                break;
            case 1:
                if (lbl_1_bss_1CC >= 0) {
                    fn_1_1274(lbl_1_bss_1CC);
                    for (var_r29 = 0; var_r29 < 4; var_r29++) {
                        var_r30 = var_r28[var_r29];
                        var_r31 = var_r30->data;
                        if (var_r29 == lbl_1_bss_1CC) {
                            var_r30->func = fn_1_1065C;
                        }
                        else {
                            var_r30->func = fn_1_11058;
                        }
                        Hu3DModelAttrSet(*var_r30->model, HU3D_ATTR_DISPOFF);
                        for (var_r26 = 0; var_r26 < 2; var_r26++) {
                            if (var_r31->unk_7C[var_r26] >= 0) {
                                HuAudFXStop(var_r31->unk_7C[var_r26]);
                                var_r31->unk_7C[var_r26] = -1;
                            }
                        }
                    }
                    lbl_1_bss_D8++;
                    return;
                }
                for (var_r29 = 0; var_r29 < 4; var_r29++) {
                    var_r31 = var_r28[var_r29]->data;
                    if (!var_r31->unk_00_field0) {
                        break;
                    }
                }
                if (var_r29 >= 4) {
                    fn_1_1274(0x63);
                    for (var_r29 = 0; var_r29 < 4; var_r29++) {
                        var_r28[var_r29]->func = fn_1_11058;
                    }
                    lbl_1_bss_D8++;
                    return;
                }
                fn_1_1275C();
                for (var_r29 = 0; var_r29 < 4; var_r29++) {
                    var_r30 = var_r28[var_r29];
                    var_r31 = var_r28[var_r29]->data;
                    if (!var_r31->unk_00_field0) {
                        var_r31->unk_14.y = VECMag(&var_r31->unk_2C);
                        if (!var_r31->unk_00_field3 && !var_r31->unk_00_field2 && (var_r31->unk_14.y > var_r31->unk_14.z)) {
                            var_r31->unk_14.y = var_r31->unk_14.z;
                            VECNormalize(&var_r31->unk_2C, &var_r31->unk_2C);
                            VECScale(&var_r31->unk_2C, &var_r31->unk_2C, var_r31->unk_14.y);
                        }
                        var_f31 = var_r31->unk_14.y;
                        VECNormalize(&var_r31->unk_2C, &sp14);

                        while (var_f31 > 0.0f) {
                            if (var_f31 < 50.0f) {
                                var_r30->trans.x += sp14.x * var_f31;
                                var_r30->trans.y += sp14.y * var_f31;
                                var_r30->trans.z += sp14.z * var_f31;
                            }
                            else {
                                var_r30->trans.x += 50.0f * sp14.x;
                                var_r30->trans.y += 50.0f * sp14.y;
                                var_r30->trans.z += 50.0f * sp14.z;
                            }
                            sp8.x = var_r30->trans.x;
                            sp8.y = 10.0f + var_r30->trans.y;
                            sp8.z = var_r30->trans.z;
                            if (fn_1_13C10(&sp8, &sp20)) {
                                var_r30->trans.x = sp8.x;
                                var_r30->trans.z = sp8.z;
                                if (var_r31->unk_00_field2 == 0) {
                                    VECNormalize(&var_r31->unk_2C, &sp14);
                                    var_f26 = VECDotProduct(&sp14, &sp20);
                                    if (var_f26 < -0.2f && var_r31->unk_14.y >= 10.0f) {
                                        omVibrate(var_r31->unk_02, 12, 6, 6);
                                    }
                                    if (var_f26 < 0.0f) {
                                        var_f28
                                            = 0.8f * (((-var_r31->unk_2C.x * sp20.x) - (var_r31->unk_2C.y * sp20.y)) - (var_r31->unk_2C.z * sp20.z));
                                        var_r31->unk_2C.x += (2.0f * sp20.x * var_f28);
                                        var_r31->unk_2C.y += (2.0f * sp20.y * var_f28);
                                        var_r31->unk_2C.z += (2.0f * sp20.z * var_f28);
                                    }
                                }
                            }
                            var_f31 -= 50.0f;
                        }
                        var_f25 = fn_1_143F4(&var_r30->trans, &var_r31->unk_44);
                        if (var_r31->unk_44.unk_00 != NULL && var_r30->trans.y < (0.01f + var_f25)) {
                            var_r30->trans.y = var_f25;
                            var_r31->unk_00_field1 = 1;
                        }
                        else {
                            var_r31->unk_00_field1 = 0;
                        }
                        fn_1_12B38(&var_r30->trans);
                        if (var_r31->unk_7C[0] >= 0) {
                            HuAudFXEmiterUpDate(var_r31->unk_7C[0], &var_r30->trans);
                        }
                    }
                }
                for (var_r29 = 0; var_r29 < 4; var_r29++) {
                    sp2C[var_r29] = NULL;
                }
                for (var_r27 = 0, var_r29 = 0; var_r29 < 4; var_r29++) {
                    var_r24 = var_r28[var_r29];
                    var_r22 = var_r24->data;
                    if (!var_r22->unk_00_field0) {
                        for (var_r25 = 0, var_r26 = 0; var_r26 < 4; var_r26++) {
                            var_r23 = var_r28[var_r26];
                            var_r21 = var_r23->data;
                            if (var_r24 != var_r23 && (!var_r21->unk_00_field0 && var_r24->trans.z > var_r23->trans.z)) {
                                var_r25++;
                            }
                        }
                        while (sp2C[var_r25] != NULL) {
                            var_r25++;
                        }
                        sp2C[var_r25] = var_r24;
                        var_r27++;
                    }
                }
                if (var_r27 != 0) {
                    var_f29 = fn_1_12194(&sp2C[0]->trans) - 1500.0f;
                    if (var_f29 >= 0.0f) {
                        fn_1_696C((1800.0001f/REFRESH_RATE) + (0.005f * var_f29));
                    }
                    else {
                        fn_1_696C((1800.0001f/REFRESH_RATE));
                    }
                    lbl_1_bss_E0[0].x = sp2C[0]->trans.x;
                    lbl_1_bss_E0[0].y = sp2C[0]->trans.y;
                    lbl_1_bss_E0[0].z = sp2C[0]->trans.z - 1000.0f;
                    fn_1_12B38(&lbl_1_bss_E0[0]);
                    if (lbl_1_bss_F8[1] == 0) {
                        lbl_1_bss_E0[1].x = sp2C[var_r27 - 1]->trans.x;
                        lbl_1_bss_E0[1].y = sp2C[var_r27 - 1]->trans.y;
                        lbl_1_bss_E0[1].z = sp2C[var_r27 - 1]->trans.z;
                        lbl_1_bss_F8[1] = 1;
                    }
                    sp20.x = sp2C[var_r27 - 1]->trans.x - lbl_1_bss_E0[1].x;
                    sp20.y = sp2C[var_r27 - 1]->trans.y - lbl_1_bss_E0[1].y;
                    sp20.z = sp2C[var_r27 - 1]->trans.z - lbl_1_bss_E0[1].z;
                    var_f29 = VECMag(&sp20);
                    VECNormalize(&sp20, &sp20);
                    if (var_f29 < 100.0f) {
                        lbl_1_bss_E0[1].x = sp2C[var_r27 - 1]->trans.x;
                        lbl_1_bss_E0[1].y = sp2C[var_r27 - 1]->trans.y;
                        lbl_1_bss_E0[1].z = sp2C[var_r27 - 1]->trans.z;
                    }
                    else {
                        lbl_1_bss_E0[1].x += (100.0f * sp20.x);
                        lbl_1_bss_E0[1].y += (100.0f * sp20.y);
                        lbl_1_bss_E0[1].z += (100.0f * sp20.z);
                    }
                    fn_1_12B38(&lbl_1_bss_E0[1]);
                    if (fn_1_122C() == 2 || fn_1_122C() == 3) {
                        return;
                    }
                    for (var_r29 = 0; var_r29 < var_r27; var_r29++) {
                        var_r30 = sp2C[var_r29];
                        var_r31 = var_r30->data;
                        if (!var_r31->unk_00_field0) {
                            var_f30 = sp2C[var_r27 - 1]->trans.z - var_r30->trans.z;
                            if (var_f30 > 3000.0f) {
                                if (var_f30 > 5000.0f) {
                                    var_f30 = 5000.0f;
                                }
                                var_f27 = 45.0f - (9.0f * (var_f30 / 5000.0f));
                            }
                            else {
                                var_f27 = 45.0f;
                            }
                            var_r31->unk_14.z += (0.2f * (var_f27 - var_r31->unk_14.z));
                        }
                    }
                    return;
                }
                break;
            case 2:
                if (fn_1_122C() == 8 || fn_1_122C() == 10) {
                    lbl_1_bss_D8++;
                    lbl_1_data_11F4 = (REFRESH_RATE*7)/2;
                    return;
                }
                break;
            case 3:
                if (--lbl_1_data_11F4 == 0) {
                    fn_1_12BC();
                }
                break;
        }
    }
}

void fn_1_1065C(omObjData *object)
{
    M406PlayerWork *var_r31 = object->data;

