zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
    var_r31->unk_12 = 0;
    var_r31->unk_00 = 0;
    var_r31->unk_54 = 1.0f;
    var_r31->unk_14.x = 0.0f;
    var_r31->unk_64 = REFRESH_RATE;
    object->trans.z = -60000.0f;
    object->rot.x = object->rot.y = object->rot.z = 0.0f;
    var_r31->unk_2C.x = var_r31->unk_2C.y = 0.0f;
    var_r31->unk_2C.z = (-1200.0f/REFRESH_RATE);
    Hu3DModelShadowReset(object->model[0]);
    fn_1_6BB4(&object->trans);
    Hu3DModelAttrReset(object->model[0], HU3D_ATTR_DISPOFF);
    object->func = fn_1_10744;
}

void fn_1_10744(omObjData *object)
{
    Mtx sp48;
    Mtx sp18;

    float var_f31;

    M406PlayerWork *var_r31;
    HU3DMODEL *var_r29;
    s32 var_r24;

    var_r31 = object->data;
    var_r29 = &Hu3DData[object->model[0]];
    switch (var_r31->unk_12) {
        case 0:
            fn_1_DD7C(object, 0, 1.0f, HU3D_MOTATTR_NONE);
            if (--var_r31->unk_64 == 0) {
                fn_1_1284();
                var_r31->unk_12++;
            }
            if (var_r31->unk_64 == (REFRESH_RATE*0.9f)) {
                HuAudFXPlay(0x541);
            }
            mtxRot(sp48, var_r29->rot.x, var_r29->rot.y, var_r29->rot.z);
            mtxTransCat(sp48, var_r29->pos.x, var_r29->pos.y, var_r29->pos.z);
            if (var_r31->unk_64 < 0x1E) {
                var_f31 = 0.0f;
            }
            else {
                var_f31 = (255.0f * (var_r31->unk_64 - 0x1E)) / 30.0f;
            }
            fn_1_82C8(sp48, frand() & 0xF, var_f31);
            break;
        case 1:
            if (fn_1_122C() == 8) {
                var_r31->unk_12++;
                var_r31->unk_14.x = 180.0f;
                var_r31->unk_64 = (REFRESH_RATE*3)/2;
                #if VERSION_NTSC
                var_r31->unk_2C.x = 100.0 * (0.1f * sind(180.0f + var_r31->unk_14.x));
                var_r31->unk_2C.y = 0.0f;
                var_r31->unk_2C.z = 100.0 * (0.1f * cosd(180.0f + var_r31->unk_14.x));
                #else
                var_r31->unk_2C.x = 100.0 * (6.0f * sind(180.0f + var_r31->unk_14.x))*(1.0f/REFRESH_RATE);
                var_r31->unk_2C.y = 0.0f;
                var_r31->unk_2C.z = 100.0 * (6.0f * cosd(180.0f + var_r31->unk_14.x))*(1.0f/REFRESH_RATE);
                #endif
                object->trans.x = 300.0f;
                object->trans.z = -1000.0f;
                object->trans.y = 1000.0f;
                CharModelKill(var_r31->unk_0C);
                object->model[0] = CharModelCreate(var_r31->unk_0C, 2);
                for (var_r24 = 0; var_r24 < 4; var_r24++) {
                    Hu3DModelHookSet(object->model[0], lbl_1_data_1068[var_r24], object->model[var_r24 + 1]);
                }
                for (var_r24 = 0; var_r24 < 10U; var_r24++) {
                    object->motion[var_r24] = CharMotionCreate(var_r31->unk_0C, lbl_1_data_1078[var_r24]);
                }
                var_r31->unk_38 = -1;
                fn_1_DD7C(object, 0, 1.0f, HU3D_MOTATTR_NONE);
                Hu3DModelShadowSet(object->model[0]);
                return;
            }
            break;
        case 2:
            var_r31->unk_2C.y += (-7200.0f/REFRESH_RATE)*(1.0f/REFRESH_RATE);
            if (object->trans.y < 0.0f) {
                object->trans.y = 0.0f;
                var_r31->unk_12++;
                var_r31->unk_2C.y = 0.0f;
                fn_1_DD7C(object, 2, 1.0f, HU3D_MOTATTR_NONE);
                omVibrate(var_r31->unk_02, 0xC, 6, 6);
                var_r31->unk_7C[0] = HuAudFXPlay(0x53B);
            }
            break;
        case 3:
            var_r31->unk_14.x -= (30.0f*(1.0f/REFRESH_RATE));
            var_r31->unk_54 = 1.0f;
            #if VERSION_NTSC
            if (var_r31->unk_64 < 0x14) {
                var_r31->unk_54 = var_r31->unk_64 / 20.0f;
            }
            if ((var_r31->unk_64 < 0x50) && (var_r31->unk_64 > 0x1E)) {
            #else
            if (var_r31->unk_64 < (REFRESH_RATE/3.0f)) {
                var_r31->unk_54 = var_r31->unk_64 / (REFRESH_RATE/3.0f);
            }
            if ((var_r31->unk_64 < ((REFRESH_RATE*4.0f)/3.0f)) && (var_r31->unk_64 > (REFRESH_RATE*0.5f))) {
            #endif
                mtxRot(sp48, var_r29->rot.x, var_r29->rot.y, var_r29->rot.z);
                mtxTransCat(sp48, var_r29->pos.x, var_r29->pos.y, var_r29->pos.z);
                MTXTrans(sp18, 10.0f, 0.0f, 0.0f);
                MTXConcat(sp18, sp48, sp48);
                fn_1_94C0(sp48, 10, 0);
            }
            #if VERSION_NTSC
            var_r31->unk_2C.x = var_r31->unk_54 * (100.0 * (0.1f * sind(180.0f + var_r31->unk_14.x)));
            var_r31->unk_2C.z = var_r31->unk_54 * (100.0 * (0.1f * cosd(180.0f + var_r31->unk_14.x)));
            #else
            var_r31->unk_2C.x = ((1.0f/REFRESH_RATE)*(100.0 * (6.0f * sind(180.0f + var_r31->unk_14.x)))*var_r31->unk_54);
            var_r31->unk_2C.z = ((1.0f/REFRESH_RATE)*(100.0 * (6.0f * cosd(180.0f + var_r31->unk_14.x)))*var_r31->unk_54);
            #endif
            if (var_r31->unk_64 == (REFRESH_RATE*0.8f)) {
                fn_1_DD7C(object, 8, 1.0f, HU3D_MOTATTR_NONE);
            }
            if (--var_r31->unk_64 == 0) {
                var_r31->unk_12 = -1;
                var_r31->unk_2C.x = var_r31->unk_2C.z = 0.0f;
            }
            break;
        default:
            break;
    }
    object->trans.x += var_r31->unk_2C.x;
    object->trans.y += var_r31->unk_2C.y;
    object->trans.z += var_r31->unk_2C.z;
    object->rot.y = 180.0f + var_r31->unk_14.x;
}

void fn_1_11058(omObjData *object)
{
    HU3DMODEL *sp8;

    M406PlayerWork *var_r30;
    void *var_r29;
    s32 var_r28;

    var_r30 = object->data;
    if (lbl_1_bss_1CC < 0) {
        object->trans.x = lbl_1_data_11F8[lbl_1_bss_1F4].unk_00;
        object->trans.z = lbl_1_data_11F8[lbl_1_bss_1F4].unk_04;
        var_r30->unk_64 = (REFRESH_RATE*0.5f) + (frand() & 0x1F);
    }
    else {
        object->trans.x = lbl_1_data_1218[lbl_1_bss_1F4].unk_00;
        object->trans.z = lbl_1_data_1218[lbl_1_bss_1F4].unk_04;
        var_r30->unk_64 = (REFRESH_RATE*1.5f) + (frand() & 0x1F);
    }
    for (var_r28 = 0; var_r28 < 8; var_r28++) {
        Hu3DModelAttrSet(object->model[var_r28], HU3D_ATTR_DISPOFF);
        Hu3DModelPosSet(object->model[var_r28], 0.0f, 0.0f, 0.0f);
        Hu3DModelRotSet(object->model[var_r28], 0.0f, 0.0f, 0.0f);
        Hu3DModelScaleSet(object->model[var_r28], 1.0f, 1.0f, 1.0f);
    }
    Hu3DModelHookReset(object->model[0]);
    fn_1_DD7C(object, 0, 1.0f, HU3D_MOTATTR_NONE);
    var_r30->unk_00 = 0;
    var_r30->unk_12 = 0;
    var_r30->unk_00_field3 = 1;
    var_r30->unk_50 = 360.0f * frandf();
    var_r30->unk_50 = 160.0f + ((frand() & 0x3F) - 0x20);
    var_r30->unk_54 = 30.0f;
    var_r30->unk_5A = 3;
    object->trans.y = 1000.0f;
    object->rot.x = object->rot.y = 0.0f;
    object->rot.z = (frand() & 0x3F) - 0x20;
    var_r30->unk_2C.x = var_r30->unk_2C.y = var_r30->unk_2C.z = 0.0f;
    lbl_1_bss_1F4++;
    object->func = fn_1_114A0;
}

void fn_1_114A0(omObjData *object)
{
    Mtx sp9C;
    Mtx sp6C;
    Mtx sp3C;
    Mtx spC;
    HU3DMODEL *sp8;
    M406PlayerWork *var_r31;

    var_r31 = object->data;
    sp8 = &Hu3DData[object->model[0]];
    switch (var_r31->unk_12) {
        case 0:
            if (fn_1_122C() == 8 || fn_1_122C() == 10) {
                var_r31->unk_12++;
            }
            return;
        case 1:
            if (var_r31->unk_64 != 0) {
                if (--var_r31->unk_64 == 0) {
                    Hu3DModelAttrReset(object->model[5], HU3D_ATTR_DISPOFF);
                    Hu3DModelAttrReset(object->model[7], HU3D_ATTR_DISPOFF);
                }
                else {
                    return;
                }
            }
            var_r31->unk_50 += var_r31->unk_54;
            var_r31->unk_54 -= 0.5f;
            if (var_r31->unk_54 < 0.0f) {
                var_r31->unk_54 = 0.0f;
            }
            if (var_r31->unk_5A != 0) {
                var_r31->unk_2C.y += (-7200.0f/REFRESH_RATE)*(1.0f/REFRESH_RATE);
                object->trans.y += var_r31->unk_2C.y;
                if (object->trans.y < 0.0f) {
                    object->trans.y = 0.0f;
                    var_r31->unk_2C.y = 0.5f * -var_r31->unk_2C.y;
                    var_r31->unk_5A--;
                    if (!var_r31->unk_00_field5) {
                        omVibrate(var_r31->unk_02, 12, 4, 2);
                        var_r31->unk_00_field5 = 1;
                        HuAudFXPlay(0x53F);
                    }
                }
            }
            break;
        default:
            break;
    }
    mtxRot(sp9C, object->rot.x, object->rot.y, object->trans.z);
    mtxScaleCat(sp9C, object->scale.x, object->scale.y, object->scale.z);
    MTXTrans(sp9C, object->trans.x, object->trans.y, object->trans.z);
    MTXRotRad(sp6C, 0x78, 0.017453292f * var_r31->unk_50);
    MTXConcat(sp9C, sp6C, sp9C);
    MTXCopy(sp9C, spC);
    mtxScaleCat(spC, 2.0f, 2.0f, 2.0f);
    MTXCopy(spC, Hu3DData[object->model[5]].mtx);
    MTXTrans(sp3C, 0.0f, 110.0f, 0.0f);
    MTXConcat(sp9C, sp3C, spC);
    MTXCopy(spC, Hu3DData[object->model[7]].mtx);
}

void fn_1_117BC(float arg8, float arg9, UnkM406PlayerStruct2 *arg0, Vec *arg1)
{
    Vec sp10;
    float spC;

    float var_f30;
    Vec *var_r31;

    if (arg0->unk_00 == NULL) {
        arg1->x = arg1->y = arg1->z = 0.0f;
        return;
    }
    var_r31 = &arg0->unk_00->nbt;
    sp10.x = var_r31->y * sind((180.0f + arg8));
    sp10.z = var_r31->y * cosd((180.0f + arg8));
    var_f30 = 1.0f - (var_r31->y * var_r31->y);
    sp10.y = -sqrtf(var_f30);
    VECScale(&sp10, arg1, arg9);
}
s32 fn_1_119E4(Vec *arg0, UnkM406PlayerStruct *arg1)
{
    Vec sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;
    float var_f27;
    float var_f26;
    float var_f25;
    float var_f24;
    float var_f23;
    float var_f22;
    float var_f21;
    float var_f20;
    float var_f19;
    float var_f18;

    s32 var_r31;
    s32 var_r30;

