zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
    for (var_r31 = 0; var_r31 < lbl_1_bss_B4 - 1; var_r31++) {
        var_r30 = var_r31 + 1;
        var_f31 = lbl_1_data_960[var_r30].x - lbl_1_data_CA8[var_r31].x;
        var_f30 = lbl_1_data_960[var_r30].z - lbl_1_data_CA8[var_r31].z;
        if (((var_f31 * (arg0->z - lbl_1_data_CA8[var_r31].z)) - (var_f30 * (arg0->x - lbl_1_data_CA8[var_r31].x))) < 0.0f) {
            var_f31 = lbl_1_data_960[var_r30].x - lbl_1_data_960[var_r31].x;
            var_f28 = lbl_1_data_CA8[var_r31].x - lbl_1_data_960[var_r31].x;
            var_f30 = lbl_1_data_960[var_r30].z - lbl_1_data_960[var_r31].z;
            var_f27 = lbl_1_data_CA8[var_r31].z - lbl_1_data_960[var_r31].z;
            var_f26 = 0.0f;
            var_f25 = 1.0f;
            var_f24 = 1.0f;
            var_f23 = 0.0f;
            var_f29 = (var_f31 * var_f27) - (var_f28 * var_f30);
            var_f22 = ((var_f26 * var_f27) - (var_f25 * var_f30)) / var_f29;
            var_f21 = ((var_f25 * var_f31) - (var_f26 * var_f28)) / var_f29;
            var_f20 = ((var_f24 * var_f27) - (var_f23 * var_f30)) / var_f29;
            var_f19 = ((var_f23 * var_f31) - (var_f24 * var_f28)) / var_f29;
            sp8.z = -(var_f22 * lbl_1_data_960[var_r31].x) - (var_f21 * lbl_1_data_960[var_r31].z);
            sp8.y = -(var_f20 * lbl_1_data_960[var_r31].x) - (var_f19 * lbl_1_data_960[var_r31].z);
        }
        else {
            var_f31 = lbl_1_data_CA8[var_r30].x - lbl_1_data_960[var_r30].x;
            var_f28 = lbl_1_data_CA8[var_r31].x - lbl_1_data_960[var_r30].x;
            var_f30 = lbl_1_data_CA8[var_r30].z - lbl_1_data_960[var_r30].z;
            var_f27 = lbl_1_data_CA8[var_r31].z - lbl_1_data_960[var_r30].z;
            var_f26 = 1.0f;
            var_f25 = 1.0f;
            var_f24 = 0.0f;
            var_f23 = -1.0f;
            var_f29 = (var_f31 * var_f27) - (var_f28 * var_f30);
            var_f22 = ((var_f26 * var_f27) - (var_f25 * var_f30)) / var_f29;
            var_f21 = ((var_f25 * var_f31) - (var_f26 * var_f28)) / var_f29;
            var_f20 = ((var_f24 * var_f27) - (var_f23 * var_f30)) / var_f29;
            var_f19 = ((var_f23 * var_f31) - (var_f24 * var_f28)) / var_f29;
            sp8.z = -(var_f22 * lbl_1_data_960[var_r30].x) - (var_f21 * lbl_1_data_960[var_r30].z);
            sp8.y = (1.0f - (var_f20 * lbl_1_data_960[var_r30].x)) - (var_f19 * lbl_1_data_960[var_r30].z);
        }
        var_f18 = sp8.z + ((var_f22 * arg0->x) + (var_f21 * arg0->z));
        sp8.x = sp8.y + ((var_f20 * arg0->x) + (var_f19 * arg0->z));
        if ((var_f18 >= 0.0f) && (var_f18 < 1.0f) && (sp8.x >= 0.0f) && (sp8.x < 1.0f)) {
            arg1->unk_00 = var_f18;
            arg1->unk_04 = sp8.x;
            return var_r31;
        }
    }
    return -1;
}

void fn_1_11FC4(Vec *arg0, float arg8, Vec *arg1)
{
    UnkM406PlayerStruct spC;

    float var_f30;
    float var_f31;
    float var_f29;
    float var_f28;

    UnkM406Struct2 *var_r31;
    s32 var_r29;
    s32 var_r28;

    var_r29 = -1;
    var_r29 = fn_1_119E4(arg0, &spC);
    if (var_r29 >= 0) {
        var_r31 = &lbl_1_bss_B8[var_r29];
        var_f31 = 0.0f;
        var_f30 = var_r31->unk_00 * spC.unk_04;
        var_f29 = var_r31->unk_00 - var_f30;

        for (var_r28 = var_r29; var_r28 < lbl_1_bss_B4 - 1; var_r28++) {
            if (var_f31 + var_f29 >= 3000.0f) {
                var_f28 = (3000.0f + var_f30) - var_f31;
                arg1->x = (var_r31->unk_14.x + (var_r31->unk_08.x * var_f28)) - (var_r31->unk_08.z * arg8);
                arg1->y = var_r31->unk_14.y + (var_r31->unk_08.y * var_f28);
                arg1->z = var_r31->unk_14.z + (var_r31->unk_08.z * var_f28) + (var_r31->unk_08.x * arg8);
                return;
            }
            var_f31 += var_f29;
            var_f30 = 0.0f;
            var_r31++;
            var_f29 = var_r31->unk_00;
        }
    }
    arg1->x = arg1->y = 0.0f;
    arg1->z = -61000.0f;
}

float fn_1_12194(Vec *arg0)
{
    Vec sp1C;
    UnkM406PlayerStruct sp14;
    UnkM406PlayerStruct spC;

    UnkM406Struct2 *var_r31;
    UnkM406Struct2 *var_r30;
    s32 var_r29;
    s32 var_r28;

    fn_1_69C0(&sp1C);
    var_r28 = fn_1_119E4(&sp1C, &sp14);
    var_r29 = fn_1_119E4(arg0, &spC);
    if (var_r28 < 0 || var_r29 < 0) {
        return -1.0f;
    }
    var_r31 = &lbl_1_bss_B8[var_r28];
    var_r30 = &lbl_1_bss_B8[var_r29];
    return (var_r30->unk_04 + (var_r30->unk_00 * spC.unk_04)) - (var_r31->unk_04 + (var_r31->unk_00 * sp14.unk_04));
}

void fn_1_12270(omObjData *object)
{
    Vec sp1C;
    Vec sp10;
    UnkM406PlayerStruct sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;
    float var_f27;

    M406PlayerWork *var_r31;
    UnkM406Struct2 *var_r30;
    s32 var_r29;
    s32 var_r28;

    var_r31 = object->data;
    if (!var_r31->unk_00_field3) {
        if (var_r31->unk_14.y < 30.000002f) {
            var_r31->unk_0A = 0x100;
        }
        else if ((frand() & 0x1FF) < (var_r31->unk_0E + 6)) {
            var_r31->unk_0A = 0x100;
        }
        if ((frand() & 0xFF) == 0) {
            var_r31->unk_78 = (400.0f + (100.0f * (4 - GWPlayerCfg[var_r31->unk_02].diff))) * ((frand() & 0x1FF) - 256.0f) / 256;
        }
        if (fabs(var_r31->unk_74 - var_r31->unk_78) > 10.0) {
            var_r31->unk_74 = var_r31->unk_74 + (0.05f * (var_r31->unk_78 - var_r31->unk_74));
        }
        var_f27 = var_r31->unk_74;
        var_r29 = -1;
        var_r29 = fn_1_119E4(&object->trans, &sp8);
        if (var_r29 >= 0) {
            var_r30 = &lbl_1_bss_B8[var_r29];
            var_f31 = 0.0f;
            var_f28 = var_r30->unk_00 * sp8.unk_04;
            var_f29 = var_r30->unk_00 - var_f28;
            for (var_r28 = var_r29; var_r28 < lbl_1_bss_B4 - 1; var_r28++) {
                if (var_f31 + var_f29 >= 3000.0f) {
                    var_f30 = (3000.0f + var_f28) - var_f31;
                    sp1C.x = (var_r30->unk_14.x + (var_r30->unk_08.x * var_f30)) - (var_r30->unk_08.z * var_f27);
                    sp1C.y = var_r30->unk_14.y + (var_r30->unk_08.y * var_f30);
                    sp1C.z = var_r30->unk_14.z + (var_r30->unk_08.z * var_f30) + (var_r30->unk_08.x * var_f27);
                    goto block_12270; // TODO
                }
                else {
                    var_f31 += var_f29;
                    var_f28 = 0.0f;
                    var_r30++;
                    var_f29 = var_r30->unk_00;
                }
            }
        }
        sp1C.x = sp1C.y = 0.0f;
        sp1C.z = -61000.0f;

