zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
    block_12270:
        VECSubtract(&sp1C, &object->trans, &sp10);
        if (VECMag(&sp10) > 0.0f) {
            VECNormalize(&sp10, &sp10);
            var_r31->unk_06 = 72.0 * ((sp10.x * cosd(CRot.y)) - sp10.z * sind(CRot.y));
            var_r31->unk_07 = 72.0 * -((sp10.x * sind(CRot.y)) + sp10.z * cosd(CRot.y));
        }
    }
    else if ((frand() & 3) == 0) {
        var_r31->unk_0A = 256;
    }
}

void fn_1_1275C(void)
{
    omObjData **sp8;
    s32 var_r31;

    var_r31 = 0;
    sp8 = omGetGroupMemberListEx(lbl_1_bss_1C8, 0);

    while (fn_1_127B8() != 0 && var_r31 < 10) {
        var_r31++;
    }
}

s32 fn_1_127B8(void)
{
    Vec sp14[4];
    Vec sp8;

    float var_f31;
    float var_f30;

    s32 var_r31;
    s32 var_r30;
    omObjData **var_r29;
    omObjData *var_r28;
    s32 var_r27;
    omObjData *var_r26;
    omObjData *var_r25;
    M406PlayerWork *var_r24;
    M406PlayerWork *var_r23;
    M406PlayerWork *var_r22;

    var_r27 = 0;
    var_r29 = omGetGroupMemberListEx(lbl_1_bss_1C8, 0);
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        sp14[var_r31].x = sp14[var_r31].y = sp14[var_r31].z = 0.0f;
    }
    for (var_r31 = 0; var_r31 < 3; var_r31++) {
        var_r26 = var_r29[var_r31];
        var_r23 = var_r26->data;
        if (!var_r23->unk_00_field0) {
            for (var_r30 = var_r31 + 1; var_r30 < 4; var_r30++) {
                var_r25 = var_r29[var_r30];
                var_r22 = var_r25->data;
                if (!var_r22->unk_00_field0) {
                    VECSubtract(&var_r26->trans, &var_r25->trans, &sp8);
                    var_f31 = VECMag(&sp8);
                    if (var_f31 < 100.0f) {
                        VECNormalize(&sp8, &sp8);
                        var_f30 = 0.01f + (0.5f * (100.0f - var_f31));
                        VECScale(&sp8, &sp8, var_f30);
                        VECAdd(&sp14[var_r31], &sp8, &sp14[var_r31]);
                        VECSubtract(&sp14[var_r30], &sp8, &sp14[var_r30]);
                        var_r27++;
                    }
                }
            }
        }
    }
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        var_r28 = var_r29[var_r31];
        var_r24 = var_r28->data;
        if (!var_r24->unk_00_field0) {
            VECAdd(&var_r28->trans, &sp14[var_r31], &var_r28->trans);
        }
    }
    return var_r27;
}

s32 fn_1_129E4(omObjData *object)
{
    Vec spC;

    float var_f31;

    s32 var_r31;
    omObjData **var_r30;
    HU3DMODEL *var_r29;

    var_r30 = omGetGroupMemberListEx(HuPrcCurrentGet(), 3);
    for (var_r31 = 0; var_r31 < var_r30[0]->mdlcnt; var_r31++) {
        var_r29 = &Hu3DData[(*var_r30)->model[var_r31]];
        VECSubtract(&var_r29->pos, &object->trans, &spC);
        var_f31 = VECMag(&spC);
        if (var_f31 < 100.0f) {
            return 1;
        }
    }
    return 0;
}

void fn_1_12AB8(omObjData *object)
{
    if (object->data != NULL) {
        HuMemDirectFree(object->data);
        object->data = NULL;
    }
}

void fn_1_12B00(omObjData *object)
{
    lbl_1_bss_1C4 = 0;
    lbl_1_bss_100 = -1.0f;
    object->func = fn_1_12BC4;
}

void fn_1_12B38(Vec *arg0)
{
    /* The original buffer is sized for one simulation pass.  Keep a defensive
     * bound as render hooks may still be invoked unexpectedly during teardown. */
    if (lbl_1_bss_1C4 >= 16) {
        return;
    }
    lbl_1_bss_104[lbl_1_bss_1C4].x = arg0->x;
    lbl_1_bss_104[lbl_1_bss_1C4].y = arg0->y;
    lbl_1_bss_104[lbl_1_bss_1C4].z = arg0->z;
    lbl_1_bss_1C4++;
}

void fn_1_12BC4(omObjData *object)
{
    Vec sp198[16];
    Vec spD8[16];
    Mtx spA8;
    Vec sp9C;
    Vec sp90;
    Vec sp84;
    Vec sp78;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;

    s32 var_r31;
    HU3DCAMERA *var_r30 = Hu3DCamera;

    if (lbl_1_bss_1C4 != 0) {
        if (fn_1_122C() == 4) {
            var_f30 = 0.4f;
        }
        else {
            var_f30 = 0.05f;
        }
        var_f31 = var_f30;
        for (var_r31 = 0; var_r31 < lbl_1_bss_1C4; var_r31++) {
            if (var_r31 == 0) {
                sp9C = sp90 = lbl_1_bss_104[var_r31];
            }
            else {
                if (lbl_1_bss_104[var_r31].x < sp9C.x) {
                    sp9C.x = lbl_1_bss_104[var_r31].x;
                }
                else if (lbl_1_bss_104[var_r31].x > sp90.x) {
                    sp90.x = lbl_1_bss_104[var_r31].x;
                }
                if (lbl_1_bss_104[var_r31].y < sp9C.y) {
                    sp9C.y = lbl_1_bss_104[var_r31].y;
                }
                else if (lbl_1_bss_104[var_r31].y > sp90.y) {
                    sp90.y = lbl_1_bss_104[var_r31].y;
                }
                if (lbl_1_bss_104[var_r31].z < sp9C.z) {
                    sp9C.z = lbl_1_bss_104[var_r31].z;
                }
                else if (lbl_1_bss_104[var_r31].z > sp90.z) {
                    sp90.z = lbl_1_bss_104[var_r31].z;
                }
            }
        }
        var_f31 = 0.4f;
        Center.x += var_f31 * ((0.5f * (sp9C.x + sp90.x)) - Center.x);
        Center.y += var_f31 * ((0.5f * (sp9C.y + sp90.y)) - Center.y);
        Center.z += var_f31 * ((0.5f * (sp9C.z + sp90.z)) - Center.z);

        var_r30->target.x = Center.x;
        var_r30->target.y = Center.y;
        var_r30->target.z = Center.z;
        C_MTXLookAt(spA8, &var_r30->pos, &var_r30->up, &var_r30->target);
        for (var_r31 = 0; var_r31 < lbl_1_bss_1C4; var_r31++) {
            MTXMultVec(spA8, &lbl_1_bss_104[var_r31], &sp198[var_r31]);
            spD8[var_r31].x = sp198[var_r31].x / (sp198[var_r31].z * (sind((var_r30->fov / 2)) / cosd((var_r30->fov / 2))));
            spD8[var_r31].y = sp198[var_r31].y / (sp198[var_r31].z * (sind((var_r30->fov / 2)) / cosd((var_r30->fov / 2))));
        }
        sp90.x = 0.0f;
        for (var_r31 = 0; var_r31 < lbl_1_bss_1C4; var_r31++) {
            if (fabs(spD8[var_r31].x) > fabs(spD8[var_r31].y)) {
                if (fabs(spD8[var_r31].x) > sp90.x) {
                    sp90.x = fabs(spD8[var_r31].x);
                    sp90.y = fabs(sp198[var_r31].x);
                    sp90.z = sp198[var_r31].z;
                }
            }
            else {
                if (fabs(spD8[var_r31].y) > sp90.x) {
                    sp90.x = fabs(spD8[var_r31].y);
                    sp90.y = fabs(sp198[var_r31].y);
                    sp90.z = sp198[var_r31].z;
                }
            }
        }
        var_f29 = -sp90.y / (sind((var_r30->fov / 2)) / cosd((var_r30->fov / 2)));
        var_f28 = CZoom - (var_f29 - sp90.z);
        var_f31 = 0.05f;
        if (lbl_1_bss_100 >= 0.0f) {
            lbl_1_bss_100 += var_f31 * (var_f28 - lbl_1_bss_100);
        }
        else {
            lbl_1_bss_100 = CZoom - 500.0f;
        }
        CZoom = 500.0f + lbl_1_bss_100;
        if (CZoom < 1500.0f) {
            CZoom = 1500.0f;
        }
        lbl_1_bss_1C4 = 0;
        if (fn_1_122C() >= 3) {
            sp84.x = Center.x + (CZoom * (sind(CRot.y) * cosd(CRot.x)));
            sp84.y = Center.y + (CZoom * -sind(CRot.x));
            sp84.z = Center.z + (CZoom * (cosd(CRot.y) * cosd(CRot.x)));
            VECSubtract(&Center, &sp84, &sp78);
            VECNormalize(&sp78, &sp78);
            HuAudFXListnerUpdate(&sp84, &sp78);
        }
    }
}

void fn_1_136A8(void) { }

