zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
s32 fn_1_136AC(HSFOBJECT *arg0, Mtx arg1, char *arg2, Mtx arg3)
{
    char sp4A4[256];
    Mtx sp174;
    Mtx sp144;
    u32 var_r23;

    HSFTRANSFORM *var_r31 = &arg0->mesh.curr;

    mtxRot(sp144, var_r31->rot.x, var_r31->rot.y, var_r31->rot.z);
    MTXScale(sp174, var_r31->scale.x, var_r31->scale.y, var_r31->scale.z);
    MTXConcat(sp144, sp174, sp174);
    mtxTransCat(sp174, var_r31->pos.x, var_r31->pos.y, var_r31->pos.z);
    MTXConcat(arg1, sp174, sp174);
    strcpy(sp4A4, MakeObjectName(arg2));
    if (strcmp(sp4A4, arg0->name) == 0) {
        MTXCopy(sp174, arg3);
        return 1;
    }
    for (var_r23 = 0; var_r23 < arg0->mesh.childrenCount; var_r23++) {
        s32 sp20 = fn_1_136AC(arg0->mesh.children[var_r23], sp174, arg2, arg3);
        if (sp20) {
            return 1;
        }
    }
    return 0;
}

void fn_1_13A88(s16 arg0, char *arg1, Mtx arg2)
{
    Mtx sp14;

    HU3DMODEL *var_r31;
    HSFDATA *var_r30;

    var_r31 = &Hu3DData[arg0];
    var_r30 = var_r31->hsf;
    MTXIdentity(sp14);
    fn_1_136AC(var_r30->root, sp14, arg1, arg2);
}

float fn_1_13AF4(float arg8, float arg9, float argA)
{
    float var_f31;
    float var_f30;
    float var_f29;

    var_f30 = fmod(arg9 - arg8, 360.0);
    var_f31 = var_f30;
    if (var_f31 < 0.0f) {
        var_f31 += 360.0f;
    }
    if (var_f31 > 180.0f) {
        var_f31 -= 360.0f;
    }
    var_f29 = fmod(arg8 + (argA * var_f31), 360.0);
    var_f31 = var_f29;
    if (var_f31 < 0.0f) {
        var_f31 += 360.0f;
    }
    return var_f31;
}

s32 fn_1_13C10(Vec *arg0, Vec *arg1)
{
    Vec *sp48[3];
    Vec sp3C;
    Vec sp30;
    Vec sp24;
    Vec sp18;
    Vec spC;
    HSFBUFFER *sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;

    HSFFACE *var_r31;
    s32 var_r29;
    HSFFACE *var_r28;
    HSFOBJECT *var_r27;
    HSFBUFFER *var_r26;
    HSFBUFFER *var_r24;
    s32 var_r23;
    s32 var_r22;
    s32 var_r21;
    omObjData **var_r20;
    HU3DMODEL *var_r19;

    var_r20 = omGetGroupMemberListEx(lbl_1_bss_1C8, 2);
    var_r21 = arg0->z / -10000.0f;
    if (var_r21 >= 6) {
#ifdef NON_MATCHING
        // TODO NON_MATCHING is this right?
        return 1;
#else
        return;
#endif
    }
    var_r19 = &Hu3DData[(*var_r20)->model[var_r21]];
    var_f29 = 100000.0f;
    var_r27 = var_r19->hsf->root;
    if (var_r27->type != 2) {
#ifdef NON_MATCHING
        return 1;
#else
        return;
#endif
    }
    var_r24 = var_r27->mesh.face;
    var_r26 = var_r27->mesh.vertex;
    sp8 = var_r27->mesh.normal;
    var_r31 = var_r24->data;
    for (var_r23 = 0; var_r23 < var_r24->count; var_r23++, var_r31++) {
        if ((var_r31->type == 2) && ((var_r31->mat & 0xFFF) == lbl_1_bss_1E8[var_r21])) {
            sp48[0] = &((Vec *)var_r26->data)[var_r31->indices[0][0]];
            sp48[1] = &((Vec *)var_r26->data)[var_r31->indices[1][0]];
            sp48[2] = &((Vec *)var_r26->data)[var_r31->indices[2][0]];

            var_f28 = (var_r31->nbt.z * sp48[0]->z) + ((var_r31->nbt.x * sp48[0]->x) + (var_r31->nbt.y * sp48[0]->y));
            sp24.x = -var_r31->nbt.x;
            sp24.y = 0.0f;
            sp24.z = -var_r31->nbt.z;
            VECNormalize(&sp24, &sp24);
            var_f31 = (var_f28 + (((-var_r31->nbt.x * arg0->x) - (var_r31->nbt.y * arg0->y)) - (var_r31->nbt.z * arg0->z)))
                / ((var_r31->nbt.x * sp24.x) + (var_r31->nbt.z * sp24.z));
            if (var_f31 <= 0.0) {
                continue;
            }
            spC.x = arg0->x + (sp24.x * var_f31);
            spC.y = arg0->y;
            spC.z = arg0->z + (sp24.z * var_f31);
            VECSubtract(sp48[1], sp48[0], &sp3C);
            VECSubtract(&spC, sp48[1], &sp30);
            VECCrossProduct(&sp3C, &sp30, &sp24);
            if (!(VECDotProduct(&var_r31->nbt, &sp24) < 0.0f)) {
                VECSubtract(sp48[2], sp48[1], &sp3C);
                VECSubtract(&spC, sp48[2], &sp30);
                VECCrossProduct(&sp3C, &sp30, &sp24);
                if (!(VECDotProduct(&var_r31->nbt, &sp24) < 0.0f)) {
                    VECSubtract(sp48[0], sp48[2], &sp3C);
                    VECSubtract(&spC, sp48[0], &sp30);
                    VECCrossProduct(&sp3C, &sp30, &sp24);
                    if (!(VECDotProduct(&var_r31->nbt, &sp24) < 0.0f) && (var_f31 < var_f29)) {
                        var_f29 = var_f31;
                        sp18 = spC;
                        var_r28 = var_r31;
                    }
                }
            }
            for (var_r29 = 0; var_r29 < 3; var_r29++) {
                var_r22 = var_r29 + 1;
                if (var_r22 > 2) {
                    var_r22 = 0;
                }
                VECSubtract(sp48[var_r22], sp48[var_r29], &sp3C);
                if (sp3C.y != 0.0f) {
                    var_f30 = (arg0->y - sp48[var_r29]->y) / sp3C.y;
                    if ((var_f30 >= 0.0f) && (var_f30 < 1.0f)) {
                        spC.x = sp48[var_r29]->x + (var_f30 * sp3C.x);
                        spC.z = sp48[var_r29]->z + (var_f30 * sp3C.z);
                        VECSubtract(&spC, arg0, &sp3C);
                        sp3C.y = 0.0f;
                        var_f31 = VECMag(&sp3C);
                        if (var_f31 < var_f29) {
                            var_f29 = var_f31;
                            sp18 = spC;
                            var_r28 = var_r31;
                        }
                    }
                }
                var_f31 = (sp3C.x * sp3C.x) + (sp3C.z * sp3C.z);
                if (var_f31 != 0.0f) {
                    var_f30 = (((arg0->z * sp3C.z) + ((arg0->x * sp3C.x) - (sp3C.x * sp48[var_r29]->x))) - (sp3C.z * sp48[var_r29]->z)) / var_f31;
                    if ((var_f30 >= 0.0f) && (var_f30 < 1.0f)) {
                        sp30.y = sp48[var_r29]->y + (var_f30 * sp3C.y);
                        if ((sp30.y >= arg0->y) && (sp30.y < (150.0f + arg0->y))) {
                            sp30.x = sp48[var_r29]->x + (var_f30 * sp3C.x);
                            sp30.z = sp48[var_r29]->z + (var_f30 * sp3C.z);
                            VECSubtract(&sp30, arg0, &sp3C);
                            sp3C.y = 0.0f;
                            var_f31 = VECMag(&sp3C);
                            if (var_f31 < var_f29) {
                                var_f29 = var_f31;
                                sp18 = sp30;
                                var_r28 = var_r31;
                            }
                        }
                    }
                }
                if ((sp48[var_r29]->y >= arg0->y) && (sp48[var_r29]->y < (150.0f + arg0->y))) {
                    VECSubtract(arg0, sp48[var_r29], &sp3C);
                    sp3C.y = 0.0f;
                    var_f31 = VECMag(&sp3C);
                    if (var_f31 < var_f29) {
                        var_f29 = var_f31;
                        sp18.x = sp48[var_r29]->x;
                        sp18.z = sp48[var_r29]->z;
                        var_r28 = var_r31;
                    }
                }
            }
        }
    }
    if (var_f29 < 100.0f) {
        VECSubtract(arg0, &sp18, &sp3C);
        sp3C.y = 0.0f;
        VECNormalize(&sp3C, &sp3C);
        arg0->x = sp18.x + (100.001f * sp3C.x);
        arg0->z = sp18.z + (100.001f * sp3C.z);
        arg1->x = var_r28->nbt.x;
        arg1->y = var_r28->nbt.y;
        arg1->z = var_r28->nbt.z;
        return 1;
    }
    return 0;
}

float fn_1_143F4(Vec *arg0, UnkM406PlayerStruct2 *arg1)
{
    Vec *sp34[3];
    Vec sp28;
    Vec sp1C;
    Vec sp10;
    HSFBUFFER *spC;
    float sp8; // ! - uninitialized

    float var_f31;
    float var_f30;

    HSFFACE *var_r31;
    HSFOBJECT *var_r30;
    HSFBUFFER *var_r28;
    s32 var_r27;
    HSFBUFFER *var_r25;
    s32 var_r24;
    omObjData **var_r23;
    HU3DMODEL *var_r22;
    s32 var_r21;

