zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/player.c
#ifdef NON_MATCHING
    sp8 = -5.0f; // TODO NON_MATCHING is this right?
#endif

    arg1->unk_00 = NULL;
    var_r23 = omGetGroupMemberListEx(lbl_1_bss_1C8, 2);
    var_r27 = arg0->z / -10000.0f;
    if (var_r27 >= 6) {
        return sp8;
    }
    var_r22 = &Hu3DData[var_r23[0]->model[var_r27]];
    var_r30 = var_r22->hsf->root;
    if (var_r30->type != 2) {
        return -100000.0f;
    }
    var_r25 = var_r30->mesh.face;
    var_r28 = var_r30->mesh.vertex;
    spC = var_r30->mesh.normal;
    for (var_r31 = var_r25->data, var_r24 = 0; var_r24 < var_r25->count; var_r24++, var_r31++) {
        if (var_r31->type == 2 && (((var_r31->mat & 0xFFF) == lbl_1_bss_1DC[var_r27]) || ((var_r31->mat & 0xFFF) == lbl_1_bss_1D0[var_r27]))) {
            sp34[0] = &((Vec *)var_r28->data)[var_r31->indices[0][0]];
            sp34[1] = &((Vec *)var_r28->data)[var_r31->indices[1][0]];
            sp34[2] = &((Vec *)var_r28->data)[var_r31->indices[2][0]];
            VECSubtract(sp34[1], sp34[0], &sp28);
            VECSubtract(arg0, sp34[1], &sp1C);
            VECCrossProduct(&sp28, &sp1C, &sp10);
            if (sp10.y < 0.0f) {
                continue;
            }
            VECSubtract(sp34[2], sp34[1], &sp28);
            VECSubtract(arg0, sp34[2], &sp1C);
            VECCrossProduct(&sp28, &sp1C, &sp10);
            if (sp10.y < 0.0f) {
                continue;
            }
            VECSubtract(sp34[0], sp34[2], &sp28);
            VECSubtract(arg0, sp34[0], &sp1C);
            VECCrossProduct(&sp28, &sp1C, &sp10);
            if (sp10.y < 0.0f) {
                continue;
            }
            var_f30 = (var_r31->nbt.z * sp34[0]->z) + ((var_r31->nbt.x * sp34[0]->x) + (var_r31->nbt.y * sp34[0]->y));
            var_f31 = ((var_f30 - (var_r31->nbt.x * arg0->x)) - (var_r31->nbt.z * arg0->z)) / var_r31->nbt.y;
            arg1->unk_00 = var_r31;
            arg1->unk_08 = (var_r31->mat & 0xFFF) == lbl_1_bss_1D0[var_r27] ? 1 : 0;
            return var_f31;
        }
    }
    return -100000.0f;
}
